#+TITLE: github

* Loadable modules
#+begin_src emacs-lisp :tangle define-modules.el
(defmacro blw/define-loadable (fn-name mod-name)
  `(defun ,fn-name ()
    (interactive)
    (load! (concat "../modules/" ,mod-name))))
#+end_src

#+RESULTS:
: blw/define-loadable

** Chinese setup
#+begin_src emacs-lisp :tangle load-modules.el
(blw/define-loadable blw/load-chinese "chinese.el")
#+end_src

#+RESULTS:
: blw/load-chinese

** LaTeX setup
#+begin_src emacs-lisp :tangle load-modules.el
(blw/define-loadable blw/load-latex "latex.el")
#+end_src

#+RESULTS:
: blw/load-latex

* Modules code
** Chinese font
#+begin_src emacs-lisp :tangle ../modules/chinese.el
(setq doom-font
      (set-fontset-font "fontset-default" 'han
                        (font-spec :family "Sarasa Mono Slab HC")))
#+end_src

#+begin_src emacs-lisp
(load! "./my-func/lw_chdoom.el")
#+end_src

#+RESULTS:
: t

*** Tables alignment

Discussion on: https://emacs-china.org/t/org-mode/440/89
#+begin_src emacs-lisp :tangle ../modules/chinese.el
(package! zh-align
  :recipe (:host github
           :repo "chen-chao/zh-align.el"))
#+end_src

#+RESULTS:
| zh-align | :modules | ((:private . Emacs) (:private . modules)) | :recipe | (:host github :repo chen-chao/zh-align.el) |

** Chinese setup with guesses
*** Input
#+begin_src emacs-lisp :tangle ../modules/chinese.el
(use-package! pyim-basedict)

(use-package! pyim
  :config
  (require 'pyim-basedict) ; 拼音词库设置，五笔用户 *不需要* 此行设置
  (pyim-basedict-enable)   ; 拼音词库，五笔用户 *不需要* 此行设置
  (setq default-input-method "pyim")
  (setq pyim-page-length 10)
  (pyim-isearch-mode 1))
#+end_src

*** Bing
#+begin_src emacs-lisp :tangle ../modules/chinese.el
(use-package! bing-dict
  :config
  (map! :leader
        (:prefix-map ("b" . "buddhi")
         (:prefix ("b" . "bing")
          :desc "Bing dictionary brief" "d" #'blw/bing-dict-brief
          :desc "Personal vocabulary" "p" #'blw/find-vocabulary)))
  ;; :desc "Activate synonym" "s" #'blw/bing-synonym))))

  (setq bing-dict-add-to-kill-ring t)
  (setq bing-dict-show-thesaurus 'both)
  (setq bing-dict-vocabulary-save t)
  (setq bing-dict-vocabulary-file "~/PP/Notes/vocabulary.org"))
#+end_src
** LaTeX
*** Minted
This change the default exportation options to =LaTeX=.
- =linenos= means each line in the code representations is numbered.

#+begin_src emacs-lisp :tangle ../modules/latex.el
(setq org-latex-listings 'minted)

(setq org-latex-custom-lang-environments
      '((emacs-lisp "common-lispcode")))

(setq org-latex-minted-options
      '(("fontsize" "\\scriptsize")
        ("linenos" "false")
        ("bgcolor" "LightGray")
        ("frame" "lines")))
#+end_src

#+name: setup-minted

#+begin_src emacs-lisp :tangle ../modules/latex.el
(map! :leader
      (:prefix-map ("b" . "buddhi")
       (:prefix ("l" . "latex")
        :desc "Shell scape" "s" #'blw/TeX-command-toggle-shell-escape)))
#+end_src

#+RESULTS:
: blw/TeX-command-toggle-shell-escape
